app/controllers/core/admingrupos_controller.rb

  def index
    @grupos = Grupo.find(:all, :conditions=>{:entidade_id=>@sessao_usuario.usuario.entidade_id})
---
SELECT * FROM "grupos" WHERE (entidade_id = 1)