app/controllers/core/entidades_controller.rb

  def index
    @entidades = Entidade.find :all
---
SELECT * FROM "entidades"

  def show
    @entidade = Entidade.find params[:id]
---
SELECT * FROM "entidades" WHERE ("entidades"."id" = 1)