app/controllers/core/gruposistemas_controller.rb

  def index
    sv = []
    @sessao_usuario.usuario.entidade.moduloentidades.each do |me|
      me.modulo.sistemas.each {|s| sv << s.id}
    end
    @gruposistemas = Gruposistema.find(:all, :conditions=>{:grupo_id=>params[:admingrupo_id]}).collect {|s| s if sv.include?(s.sistema_id)}.compact
---
SELECT * FROM "entidades" WHERE ("entidades"."id" = 1)
SELECT * FROM "moduloentidades" WHERE ("moduloentidades".entidade_id = 1)
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)
SELECT * FROM "modulos" WHERE ("modulos"."id" = 1)
SELECT * FROM "sistemas" WHERE ("sistemas".modulo_id = 1)
SELECT * FROM "gruposistemas" WHERE (grupo_id = '1' )
SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 1)

  def create
    if params[:sistemas]
      if params[:commit] == "Adicionar"
        params[:sistemas].each {|s| Gruposistema.create(:sistema_id=>s, :grupo_id=>params[:admingrupo_id])}
---
INSERT INTO "gruposistemas" ("sistema_id", "permissao", "grupo_id") VALUES(18, NULL, 1)