app/controllers/core/install_controller.rb

  def index
    @log  = ""
    entidade = Entidade.create(:nome=>"ECM", :razao_social=>"ECM Ltda", :cpf_cnpj=>"08505672000160", :cidade=>"Macapá", :endereco=>"Rua Iraci Nunes Nadler, nº 346", :bairro=>"Santa Nines", :cep=>"68901-380", :telefone=>"3242-5877", :email=>"comercial@ECMbrasil.com.br", :nome_responsavel=>"Isaac de Almeida Gerra", :telefone_responsavel=>"8113-8057", :email_responsavel=>"isaac@ECMbrasil.com.br", :status=>true, :tema=>"infodoc")
    @log << "#ID da Entidade - #{entidade.id}\n"
    madmg = Modulo.create(:nome=>"Administração Geral", :descricao=>"Administração Geral")
    @log << "#ID da modulos Administracao Geral - #{madmg.id}\n"
    madm = Modulo.create(:nome=>"Administração", :descricao=>"Administração")
    @log << "#ID da modulos Administracao - #{madm.id}\n"
    mecm = Modulo.create(:nome=>"Gerencia ECM", :descricao=>"Gerencia ECM")
    @log << "#ID da modulos ECM - #{mecm.id}\n"
    mgde = Modulo.create(:nome=>"Gerencia de Documento Eletrônico", :descricao=>"Gerencia de Documento Eletrônico")
    @log << "#ID da modulos GDE - #{mgde.id}\n"
    mgc = Modulo.create(:nome=>"Gerencia de Conteúdo", :descricao=>"Gerencia de Conteúdo")
    @log << "#ID da modulos Gerencia de Conteúdo - #{mgc.id}\n"
    mwiki = Modulo.create(:nome=>"Wiki", :descricao=>"Wiki de Conteúdo")
    @log << "#ID da modulos Wiki - #{mwiki.id}\n"

    vmadmg = Moduloentidade.create(:entidade_id=>entidade.id, :modulo_id=>madmg.id)
    vmadm = Moduloentidade.create(:entidade_id=>entidade.id, :modulo_id=>madm.id)
    vecm = Moduloentidade.create(:entidade_id=>entidade.id, :modulo_id=>mecm.id)
    vgc = Moduloentidade.create(:entidade_id=>entidade.id, :modulo_id=>mgc.id)
    vwiki = Moduloentidade.create(:entidade_id=>entidade.id, :modulo_id=>mwiki.id)
    @log << "#ID da vinculação do modulo a entidade - #{vmadmg.id}\n"
    @log << "#ID da vinculação do modulo a entidade - #{vmadm.id}\n"
    @log << "#ID da vinculação do modulo a entidade - #{vecm.id}\n"
    @log << "#ID da vinculação do modulo a entidade - #{vgc.id}\n"
    @log << "#ID da vinculação do modulo a entidade - #{vwiki.id}\n"

    gerenciaentidades = Sistema.create(:nome=>"Gerencia de Entidades", :descricao=>"Gerencia de Entidades", :rota=>"/core/entidades", :controle=>"Core::EntidadesController", :menu=>true, :status=>true, :modulo_id=>madmg.id)
    @log << "#ID do sistema  de Gerencia da Entidades - #{gerenciaentidades.id}\n"
    gerenciausuarios = Sistema.create(:nome=>"Gerencia de Usuarios", :descricao=>"Gerencia de Usuarios", :rota=>"/core/entidades", :controle=>"Core::UsuariosController", :menu=>false, :status=>true, :modulo_id=>madmg.id)
    @log << "#ID do sistema  de Gerencia de Usuarios - #{gerenciausuarios.id}\n"
    gerenciagrupos = Sistema.create(:nome=>"Gerencia de Grupos", :descricao=>"Gerencia de Grupos", :rota=>"/core/entidades", :controle=>"Core::GruposController", :menu=>false, :status=>true, :modulo_id=>madmg.id)
---
INSERT INTO "entidades" ("cpf_cnpj", "endereco", "email_responsavel", "telefone", "created_at", "nome", "cep", "updated_at", "telefone_responsavel", "bairro", "razao_social", "cidade", "nome_responsavel", "status", "email") VALUES('08505672000160', 'Rua Iraci Nunes Nadler, nº 346', 'isaac@infomanagerbrasil.com.br', '3242-5877', '2009-07-09 12:03:43', 'Infomanager', '68901-380', '2009-07-09 12:03:43', '8113-8057', 'Santa Nines', 'Infomanager Ltda', 'Macapá', 'Isaac de Almeida Gerra', 't', 'comercial@infomanagerbrasil.com.br')
INSERT INTO "modulos" ("created_at", "nome", "updated_at", "descricao", "status") VALUES('2009-07-09 11:55:52', 'Administração Geral', '2009-07-09 11:55:52', 'Administração Geral', 't')
INSERT INTO "moduloentidades" ("modulo_id", "entidade_id") VALUES(1, 1)
INSERT INTO "sistemas" ("created_at", "nome", "rota", "updated_at", "modulo_id", "controle", "descricao", "menu", "status") VALUES('2009-07-09 11:55:52', 'Gerencia de Entidades', '/core/entidades', '2009-07-09 11:55:52', 1, 'Core::EntidadesController', 'Gerencia de Entidades', 't', 't')
INSERT INTO "grupos" ("created_at", "nome", "updated_at", "descricao", "status", "entidade_id") VALUES('2009-07-09 12:03:43', 'Administradores', '2009-07-09 12:03:43', 'Administradores', 't', 1)

    @log << "#ID do sistema  de Administracao de usuarios - #{administracaodeusuarios.id}\n"
    administracaomudarsenha = Sistema.create(:nome=>"Administração de Mudança de Senha", :descricao=>"Administração de Mudança de Senha", :rota=>"/core/adminusuarios", :controle=>"Core::AdminmudarsenhasController", :menu=>false, :status=>true, :modulo_id=>madm.id)
    @log << "#ID do sistema  de Administracao de senhas - #{administracaomudarsenha.id}\n"
    vincularusuariogrupo = Sistema.create(:nome=>"Vinculação de Usuarios aos Grupos", :descricao=>"Vinculação de Usuarios aos Grupos", :rota=>"/core/admingrupos", :controle=>"Core::GrupousuariosController", :menu=>false, :status=>true, :modulo_id=>madm.id)
---
INSERT INTO "gruposistemas" ("sistema_id", "permissao", "grupo_id") VALUES(1, 3, 1)
INSERT INTO "grupousuarios" ("usuario_id", "grupo_id") VALUES(1, 1)

    shwiki = Sistema.create(:nome=>"InfoHistoriaWiki", :descricao=>"infohistoriawiki", :rota=>"/wiki/wiki", :controle=>"Wiki::WikihistoriapagesController", :menu=>false, :status=>true, :modulo_id=>mwiki.id)

    #ecm tipos de itens
    Formulariotipo.create(:tipo=>"Pasta", :status=>true)
---
INSERT INTO "formulariotipos" ("tipo", "status") VALUES('Pasta', 't')

    Formulariotipo.create(:tipo=>"Itentegração com Web Service", :status=>false)

    #ecm tipos de itens
    Itenstipo.create(:nome=>"Texto", :tipo=>"texto", :status=>true, :componente=>"texto")
---
INSERT INTO "itenstipos" ("tipo", "nome", "status", "componente") VALUES('texto', 'Texto', 't', 'texto')

    grupoadministrador = Grupo.create(:entidade_id=>entidade.id, :nome=>"Administradores", :descricao=>"Administradores")
    @log << "ID do grupo - #{grupoadministrador.id}\n"

    Sistema.all.each do |s|
---
SELECT * FROM "sistemas"