app/controllers/core/modulos_controller.rb

SELECT * FROM "modulos"
---
  def index
    @modulos = Modulo.find :all

SELECT * FROM "modulos" WHERE ("modulos"."id" = 3)
---
  def show
    @modulo = Modulo.find params[:id]

INSERT INTO "modulos" ("created_at", "nome", "updated_at", "descricao", "status") VALUES('2009-07-10 13:11:31', 'Gerencia de Conteudo', '2009-07-10 13:11:31', 'Gerencia de Conteudo', 't')
---
  def create
    @modulo = Modulo.new(params[:modulo])
    if @modulo.save

SELECT * FROM "modulos" WHERE ("modulos"."id" = 3)
---
  def edit
    @modulo = Modulo.find(params[:id])

SELECT * FROM "modulos" WHERE ("modulos"."id" = 3)
UPDATE "modulos" SET "updated_at" = '2009-07-09 12:15:47', "descricao" = 'Gerencia ECM', "nome" = 'Gerencia ECM' WHERE "id" = 3
---
  def update
    @modulo = Modulo.find(params[:id])
    if @modulo.update_attributes(params[:modulo])