app/controllers/core/moduloentidades_controller.rb

SELECT * FROM "entidades" WHERE ("entidades"."id" = 1)
SELECT * FROM "moduloentidades" WHERE ("moduloentidades".entidade_id = 1)
SELECT * FROM "modulos" WHERE ("modulos"."id" = 1)
SELECT count(*) AS count_all FROM "moduloentidades" WHERE ("moduloentidades".entidade_id = 1)
---
  def index
    @entidade = Entidade.find(params[:entidade_id])
    if @entidade.moduloentidades.size > 0

INSERT INTO "moduloentidades" ("modulo_id", "entidade_id") VALUES(4, 1)
---
  def create
    if params[:modulos]
      if params[:commit] == "Adicionar"
        params[:modulos].each {|m| Moduloentidade.create(:modulo_id=>m, :entidade_id=>params[:entidade_id])}