app/controllers/core/perfil_controller.rb

UPDATE "sessaos" SET "ultima_data_acesso" = '2009-07-10 13:13:25', "opcoes" = '---
---
  def update
    @usuario = @sessao_usuario.usuario
    if @usuario.encriptar(@usuario.chave_criptografia, params[:senha_atual]) == @usuario.senha_encriptada
      if @usuario.update_attributes(params[:usuario])