app/controllers/core/sistemas_controller.rb

  def index
    @modulo = Modulo.find params[:modulo_id]
    @sistema = Sistema.find(:all, :conditions=>{:modulo_id=>params[:modulo_id]})
---
SELECT * FROM "modulos" WHERE ("modulos"."id" = 1)
SELECT * FROM "sistemas" WHERE ("sistemas".modulo_id = 1)

  def show
    @modulo = Modulo.find params[:modulo_id]
    @sistema = Sistema.find params[:id]
---
SELECT * FROM "modulos" WHERE ("modulos"."id" = 1)
SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 1)

  def new
    @modulo = Modulo.find params[:modulo_id]
---
SELECT * FROM "modulos" WHERE ("modulos"."id" = 4)

  def create
    @sistema = Sistema.new(params[:sistema])
    @sistema.modulo_id = params[:modulo_id]
    @sistema.status = true
	  if @sistema.save
---
INSERT INTO "sistemas" ("created_at", "nome", "rota", "updated_at", "modulo_id", "controle", "descricao", "menu", "status") VALUES('2009-07-10 13:12:22', 'Cadastros', '/ecm/cadastros', '2009-07-10 13:12:22', 4, 'Ecm::CadastrosController', 'Cadastros', 't', 't')