app/controllers/ecm/cadastros_controller.rb

SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
---
  def index
    @formulario = Formulario.find(params[:formulario_id])

SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
SELECT * FROM "cadastros" WHERE ("cadastros"."id" = 1)
---
  def show
    @formulario = Formulario.find(params[:formulario_id])
    @cadastro = Cadastro.find(params[:id])

SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
---
  def new
    @formulario = Formulario.find(params[:formulario_id])

SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
INSERT INTO "cadastros" ("formulario_id", "created_at", "usuario_id", "updated_at", "formulariocategoria_id", "formulariotipo_id", "status", "entidade_id") VALUES(1, '2009-07-14 11:15:28', 1, '2009-07-14 11:15:28', 1, 1, NULL, 1)
---
  def create
    @formulario = Formulario.find(params[:formulario_id])
    @cadastro = Cadastro.new()
    @cadastro.monta_acessores(@formulario)
    @cadastro.validar(@formulario, params[:cadastro])
    if @cadastro.errors.count > 0
      @params = params[:cadastro]
      render :action => "new"
    else
      @cadastro.entidade_id = params[:cadastro][:entidade_id]
      @cadastro.formulario_id = params[:cadastro][:formulario_id]
      @cadastro.formulariocategoria_id = params[:cadastro][:formulariocategoria_id]
      @cadastro.formulariotipo_id = params[:cadastro][:formulariotipo_id]
      @cadastro.usuario_id = params[:cadastro][:usuario_id]
      @cadastro.save

SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
SELECT * FROM "cadastros" WHERE ("cadastros"."id" = 3)
---
  def edit
    @formulario = Formulario.find(params[:formulario_id])
    @cadastro = Cadastro.find(params[:id])

SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
SELECT * FROM "cadastros" WHERE ("cadastros"."id" = 3)
---
  def update
    @formulario = Formulario.find(params[:formulario_id])
    @cadastro = Cadastro.find(params[:id])

SELECT * FROM "formularios" WHERE ("formularios"."id" = 1)
SELECT * FROM "itensformularios" WHERE ("itensformularios"."id" = 1)
SELECT * FROM "ecm_item_textos" WHERE (conteudo like '%%') AND ((itensformulario_id = 1) AND (formulario_id = 1))
---
  def busca
    @formulario = Formulario.find(params[:id])
    @principal = Itensformulario.find(@formulario.principal_id)
    @cadastro_itens = EcmItemTexto.do_formulario(@formulario.id).do_itens_formulario(@formulario.principal_id).find(:all, :conditions=>["conteudo like ?", "%#{params[:filtro]}%"])