app/controllers/ecm/categorias_controller.rb

  def index
    @categorias = Formulariocategoria.da_entidade(@sessao_usuario.entidade_id).find(:all)
---
SELECT * FROM "formulariocategorias" WHERE (entidade_id = 1)

  def show
    @categoria = Formulariocategoria.find(params[:id])
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)

  def create
    @categoria = Formulariocategoria.new(params[:formulariocategoria])
	  if @categoria.save
---
INSERT INTO "formulariocategorias" ("nome", "descricao", "entidade_id") VALUES('Recursos Humanos', 'Recursos Humanos', 1)

  def edit
    @categoria = Formulariocategoria.find(params[:id])
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)

  def update
    @categoria = Formulariocategoria.find(params[:id])
    if @categoria.update_attributes(params[:formulariocategoria])
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)
UPDATE "formulariocategorias" SET "nome" = 'Recursos Humanos1' WHERE "id" = 1