app/controllers/ecm/formularios_controller.rb

  def index
    @categoria = Formulariocategoria.find(params[:categoria_id])
    @formularios = Formulario.da_categoria(params[:categoria_id]).find(:all)
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)
SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)

  def show
    @categoria = Formulariocategoria.find(params[:categoria_id])
    @formulario = Formulario.find(params[:id])
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)
SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)

  def new
    @categoria = Formulariocategoria.find(params[:categoria_id])
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)

  def create
    @categoria = Formulariocategoria.find(params[:categoria_id])
    @formulario = Formulario.new(params[:formulario])
    @formulario.formulariocategoria_id = params[:categoria_id]
	  if @formulario.save
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)
INSERT INTO "formularios" ("principal_id", "created_at", "titulo", "updated_at", "formulariocategoria_id", "formulariotipo_id", "descricao", "status", "entidade_id") VALUES(NULL, '2009-07-09 13:40:28', 'Cadastro Funcional', '2009-07-09 13:40:28', 1, 1, 'Cadastro Funcional', 't', 1)

  def edit
    @categoria = Formulariocategoria.find(params[:categoria_id])
    @formulario = Formulario.find(params[:id])
---
SELECT * FROM "formulariocategorias" WHERE ("formulariocategorias"."id" = 1)
SELECT * FROM "formularios" WHERE ("formularios"."id" = 1)