app/controllers/ecm/itens_formularios_controller.rb

  def index
    @formulario = Formulario.find(params[:formulario_id])
    @form_itens = Itensformulario.do_formulario(params[:formulario_id]).find(:all)
---
SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
SELECT * FROM "itensformularios" WHERE ("itensformularios"."id" = 1)

  def show
    @formulario = Formulario.find(params[:formulario_id])
    @form_item = Itensformulario.find(params[:id])
---
SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
SELECT * FROM "itensformularios" WHERE ("itensformularios"."id" = 1)

  def new
    @formulario = Formulario.find(params[:formulario_id])
---
SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)

  def create
    @formulario = Formulario.find(params[:formulario_id])
    @itenstipo = Itenstipo.find(params[:itensformulario][:itenstipo_id])
    @form_item = Itensformulario.new(params[:itensformulario])
    @form_item.tipo = @itenstipo.tipo
    @form_item.opcoes = params[:opcoes]
	  if @form_item.save
---
SELECT * FROM "formularios" WHERE ("formularios"."id" = 1)
SELECT * FROM "itenstipos" WHERE ("itenstipos"."id" = 1)
INSERT INTO "itensformularios" ("tipo", "formulario_id", "rotulo", "exemplo", "posicao", "itenstipo_id", "opcoes", "entidade_id", "componente") VALUES('Texto', 1, 'dsdfsdf', NULL, NULL, 3, '--- !map:HashWithIndifferentAccess

  def edit
    @formulario = Formulario.find(params[:formulario_id])
    @form_item = Itensformulario.find(params[:id])
---
SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
SELECT * FROM "itensformularios" WHERE ("itensformularios"."id" = 2)

  def update
    @formulario = Formulario.find(params[:formulario_id])
    @form_item = Itensformulario.find(params[:id])
    if @form_item.update_attributes(params[:itensformulario])
---
SELECT * FROM "formularios" WHERE ("formularios"."id" = 1)
SELECT * FROM "itensformularios" WHERE ("itensformularios"."id" = 2)
UPDATE "itensformularios" SET "tipo" = 'Texto', "rotulo" = 'Endereço', "opcoes" = '--- !map:HashWithIndifferentAccess

  def montaformitem
    @itenstipo = Itenstipo.find(params[:itenstipo_id])
---
SELECT * FROM "itenstipos" WHERE ("itenstipos"."id" = 3)