app/controllers/ecm/principal_formularios_controller.rb

  def index
    @formulario = Formulario.find(params[:formulario_id])
    @itens = Itensformulario.do_formulario(params[:formulario_id]).do_tipo("texto").find(:all)
---
SELECT * FROM "formularios" WHERE ("formularios".formulariocategoria_id = 1)
SELECT * FROM "itensformularios" WHERE ((tipo = 'texto') AND (formulario_id = '1'))

  def show
    @formulario = Formulario.find(params[:formulario_id])
    @formulario.principal_id = params[:id]
	  @formulario.save
---
SELECT * FROM "formularios" WHERE ("formularios"."id" = 1)
UPDATE "formularios" SET "updated_at" = '2009-07-14 11:15:06', "principal_id" = 1 WHERE "id" = 1